-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 01, 2022 at 01:00 PM
-- Server version: 10.4.18-MariaDB
-- PHP Version: 7.3.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `blogs`
--

-- --------------------------------------------------------

--
-- Table structure for table `admins`
--

CREATE TABLE `admins` (
  `id` int(11) NOT NULL,
  `username` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(50) NOT NULL,
  `Date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `admins`
--

INSERT INTO `admins` (`id`, `username`, `email`, `password`, `Date`) VALUES
(1, 'abdelrhman', 'admin@gmail.com', '123', '2022-01-30 13:34:45');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `categoryName` varchar(200) NOT NULL,
  `Date` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `categoryName`, `Date`) VALUES
(10, 'علوم', '2022-01-28 12:31:51'),
(13, 'تاريخ اسلامي', '2022-01-29 20:05:50'),
(14, 'رياضه', '2022-01-29 20:06:02'),
(15, 'معلومات عامه', '2022-01-29 20:06:14'),
(16, 'برمجه', '2022-01-30 11:57:25');

-- --------------------------------------------------------

--
-- Table structure for table `new_posts`
--

CREATE TABLE `new_posts` (
  `id` int(11) NOT NULL,
  `author` varchar(100) NOT NULL,
  `title` varchar(100) NOT NULL,
  `cateName` varchar(100) NOT NULL,
  `image` varchar(100) NOT NULL,
  `message` varchar(1000) NOT NULL,
  `Date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `new_posts`
--

INSERT INTO `new_posts` (`id`, `author`, `title`, `cateName`, `image`, `message`, `Date`) VALUES
(20, 'عبدالرحمن', 'المعلومات الجغرافية العامة ', 'معلومات عامه', '1643487255.jpg', 'بعض المعلومات الجغرافية العامة توضح النقاط التالية بعض المعلومات الجغرافية العامة:[١] إنّ المحيط الهادي يغطي ثلث الأرض. إنّ حوالي 90% من سكان العالم يعيشون في نصف الكرة الشمالي، كما يعيش حوالي 70% من سكان العالم في قارتي أوروبا وآسيا. إنّ أعلى درجة حرارة سجلت على الأرض هي 56.72 مئوية في وادي الموت في كاليفورنيا في الولايات المتحدة، ووصلت أدنى درجة حرارة على الأرض إلى -94.7 مئوية في شرق القارة القطبية الجنوبية. إنّ دولة الصين تعدّ أكبر منتج للأرز في العالم، وهي تنتج ما يقارب من 33.9% من إمدادات الأرز في العالم، وتعدّ دولة تايلاند ثاني اكبر منتج ومصدر للأرز في العالم.[٢] إنّ بحيرة فيكتوريا تعدّ أكبر بحيرة في أفريقيا، وهي تقع في شرق أفريقيا على الحدود بين أوغندا وكينيا وتنزانيا، وهي تعدّ ثاني أكبر بحيرة للمياه العذبة في العالم، بعد بحيرة سوبيريور في أمريكا الشمالية.[٢] إنّ دولة إندونيسيا تمتلك أكبر عدد من المسلمين في العالم، حيث يشكل المسلمون قرابة 87% من سكان إندونيسيا البالغ عددهم 216 مليون نسمة، وبناءً عليه تضم دولة إندونيسيا ما يقارب من 188 مليون مسلم.[٢]\r\n\r\n', '2022-01-29 20:14:15'),
(21, 'عبدالرحمن', ' المعلومات الكيميائية العامة', 'معلومات عامه', '1643487354.jpg', 'بعض المعلومات الكيميائية العامة توضح النقاط التالية بعض المعلومات العامة في الكيمياء:[٣] إنّ غاز الأكسجين عديم اللون، إلا أنّه أزرق اللون في الحالتين السائلة والصلبة. إنّ العنصر النقي يمكن أن يتخذ أشكالاً عدة؛ فعلى سبيل المثال، يعدّ كل من الماس والجرافيت أشكالاً من الكربون النقي. إنّ المعادن الوحيدة التي ليست فضية اللون هي الذهب والنحاس. إنّ مستوى الماء ينخفض بدلاً من أن يفيض، عند وضع حفنة من الملح في كوب ممتلئ بالماء. إنّ الماء يتمدد عند تجمده على عكس الكثير من المواد؛ حيث يحتل مكعب الثلج حجماً يزيد 9% على حجم المياه المستخدمة لتكوينه. إنّ بالونات الهيليوم تطفو في الهواء؛ لأنّ الهيليوم أخف وزناً من الهواء. إنّ كوكب المريخ أحمر اللون؛ بسبب احتواء سطحه على الكثير من أكسيد الحديد أو الصدأ. إنّ الإنسان يشعر بالعطش عندما يفقد قرابة 1% من الماء المتواجد في الجسم. إنّ البروم والزئبق يعدان العنصران الوحيدان اللذان يتواجدان بالشكل السائل على درجة حرارة الغرفة، ويمكن تذويب كتلة\r\n\r\nإقرأ المزيد على موضوع.كوم: https://mawdoo3.com/%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA_%D8%B9%D8%A7%D9%85%D8%A9_', '2022-01-29 20:15:54'),
(22, 'عبدالرحمن', 'معلومات عامة عن جسم الإنسان', 'معلومات عامه', '1643487474.jpg', 'معلومات عامة عن جسم الإنسان من أهم المعلومات حول جسم الإنسان ما يأتي:[٦] يبدو الإنسان أطول في الصباح. ينبض قلب الإنسان ما يعادل 100.000 مرة يوميًا. يكون أعلى تدفق للدم في الكلى. يمكن للإنسان ملء حوضي استحمام من اللعاب الذي يفرزه لمدة سنة. يعتبر اللون الوردي هو لون الرئة الصحي. يمكن لأوعية الجسم الدموية عند تجميعها أن تلتف حول الكرة الأرضية. يحلم الإنسان أحلامه باللون الأبيض والأسود. يحتوي جسم الإنسان على 600 عضلة تقريبًا. يحتوي اللسان على 200 – 400 من براعم التذوق. يحتاج دماغ الإنسان إلى جهد أكبر لتخزين الذكريات الجديدة وذلك لعدم قدرته على إزالة الذكريات القديمة بسهولة مع التقدم في السن. تحتوي البشرة على أكثر من 1000 نوع من أنواع البكتيريا المختلفة. تعد عظمة الفخذ هي أطول وأقوى عظمة في جسم الإنسان. وُجد أن الإنسان يميل ليشبه والده أكثر من والدته عبر الأجيال المُتوارثة. تنمو أظافر اليدين بشكل أسرع من أظافر القدمين. يحتوي جسم الإنسان على عدد كبير جدًا من الغدد العرقية.\r\n\r\nإقرأ المزيد على موضوع.كوم: https://mawdoo3.com/%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA_%D8%B9%D8%A7%D9%85%D8%A9#.D', '2022-01-29 20:17:54'),
(23, 'عبدالرحمن', 'الرياضة', 'رياضه', '1643487586.jpg', 'الرياضة هي مجهود جسدي عادي أو مهارة تُمَارَس بموجب قواعد مُتفق عليها بهدف الترفيه أو المنافَسة أو المُتعة أو التميز أو تطوير المهارات أو تقوية الثقة بالنفس أو الجسد . واختلاف الأهداف من حيث اجتماعها أو انفرادها يميز الرياضات، بالإضافة إلى ما يضيفه اللاعبون أو الفِرَق من تأثيرٍ على رياضاتهم.\r\n\r\nالتربية البدنية هي الجانب المتكامل من التربية يعمل على تنمية الفرد وتكيفه جسديًّا وعقليًّا واجتماعيًّا ووجدانيًّا عن طريق الأنشطة البدنية المُختارة التي تتناسب مع مرحلة النمو، والتي تُمارس بإشراف قيادةٍ صالحةٍ لتحقيقِ أسمى القيم الإنسانية وبذلك فإن تعبير التربية الرياضية أوسع بكثير وأعمق دلالةً بالنسبة لحياةِ الإنسان من كونه مجرد صحة البدن أو الثقافة البدنية أو التمرينات والتدريبات البدنية أو الألعاب الرياضية، فهو مجال من مجالات التربية الشاملة التي تشكل التربية الرياضية ميدانا حيا منه مشيرا إلى أن برامجه ليست مجرد تدريبات تُؤَدَّى ولكنها بإشراف قيادةٍ مؤهلة تساعد على جعل حياة الإنسان ملائمةً لمتطلبات العصر .', '2022-01-29 20:19:46'),
(24, 'عبدالرحمن', 'فوائد الرياضة والحركة', 'رياضه', '1643487651.jpg', ' كيميائية مثل \"الاندرفينس\" التي تجعل الإنسان يشعر بأنه في حال أفضل. كما أن هناك العديد من ألعاب الرياضة التي تتميز بالتشويق مثل كرة القدم والقفز العالي وسباق الحواجز.\r\n\r\nولممارسة الرياضة لست في حاجة إلى قضاء ساعات في صالة التمارين الرياضية، كل ما تحتاجه هو إضافة القليل من الحركة للروتين اليومي. أثبتت الدراسات الحديثة أن الرياضة البدنية تفيد الجسم كثيراً وتؤدي إلى:\r\n\r\nالتقليل من نسبة الإصابة بمرض السكري\r\nتحكم أفضل بنسبة سكر في الدم\r\nالتقليل من نسبة الإصابة بأمراض القلب والشرايين والكولسترول\r\nالمحافظة على الوزن\r\nالتقليل من الإصابة بالبرد\r\nذاكرة أفضل\r\nنوم أفضل\r\nالمحافظة على المفاصل\r\nزيادة الثقة بالنفس\r\nتحكم أفضل بالضغوطات والتوتر\r\nزيادة الحيوانات المنوية ', '2022-01-29 20:20:51'),
(25, 'عبدالرحمن', 'السباحة', 'رياضه', '1643487735.jpg', 'السباحة واحدةٌ من أشهر الرياضات وأكثرها ممارسةً من قبل الرياضيين، فالبعض منهم يعتبرها قمّة المتعة، والرياضة التي تمدّهم بالنشاط والحيوية على الدوام. السباحة أساساً هي الحركة التي تتحرّكها الكائنات الحية في الماء دون أن تسير في قاع المسطّح المائي أو البركة المائية. تعود السباحة إلى العصر الحجريّ قبل أكثر من 10 آلاف سنة، وتمّ افتتاح أول حمام للسباحة الداخلية في عام 1828 تحت اسم سانت جورج للجمهور، وقد ظهرت المنافسات في هذا المجال كنشاط ترفيهيّ في البلاد الإنجليزيّ خلال عام 1830 ميلاديّة، وفي عام 1837 قامت الجمعيّة الوطنيّة للسباحة بعقد مسابقات للسباحة العاديّة في ستة حمامات سباحة اصطناعية التي توجد في المدينة اللندنيّة، وفي عام 1880 كان النشاط الترفيهي للسباحة هو الأكثر أهميّة؛ وذلك لوجود هيئة حكم وطنيّة، وجمعية هواة للسباحين، وأكثر 300 نادٍ إقليمي من جميع أنحاء البلاد. قدِم اثنان من المشاركين الأمريكيّين في مسابقة السباحة اللندنيّة في عام 1844 وهذا أحد الأسباب التي أدّت إلى انتشار اللعبة في العالم، وكان الكابتن ماثيو ويب أوّل رجل يسبح في بحر المانش الذي يقع بين إنجلترا وفرنسا في عام 1875', '2022-01-29 20:22:15'),
(26, 'عبدالرحمن', 'يمتد التاريخ الإسلامي', 'تاريخ اسلامي', '1643487887.jpg', 'يمتد التاريخ الإسلامي على فترة زمنية طويلة تغطي معظم العصور الوسيطة على مساحة جغرافية واسعة تمتد من حدود الصين في آسيا إلى غرب آسيا وشمال أفريقيا وصولا إلى الأندلس. ويمكن اعتبار التاريخ الإسلامي يمتد منذ بداية الدعوة الإسلامية بعد نزول الوحي في شبه الجزيرة العربية على النبي محمد بن عبد الله بمكة ثم تأسيس الدولة الإسلامية بالمدينة المنورة مرورا بالدولة الأموية في دمشق التي امتدت من حدود الصين حتى جبال البرانس شمال الأندلس ثم الدولة العباسية، بما تضمنته هذه الدول الإسلامية من إمارات وسلطنات ودول مثل السلاجقة والبويهيين وفي المغرب الأدارسة والمرابطون ثم الموحدون وفي بلاد الشام الحمدانيون والزنكيون وغيرهم، أخيرا في مصر الفاطميون وفي الشام ومصر مثل - الأيوبيون والمماليك ثم سيطرة الدولة العثمانية التي تعدّ آخر الإمبراطوريات التي كانت تحكم باسم الإسلام على امتداد رقعة جغرافية واسعة، وكانت تلك الإمبراطوريات التي ذكرت قد حكمت رقع واسعة من البلاد غير العربية، فوصلوا إلى بلاد ما وراء النهر شرقا وفرنسا وإسبانيا غربا.', '2022-01-29 20:24:47'),
(27, 'عبدالرحمن', 'العِلْـمُ (الجمع: العُلومْ)', 'علوم', '1643487959.jpg', 'العِلْـمُ (الجمع: العُلومْ) (باللاتينية: Scientia) أي \"المعرفة\" هو أسلوب منهجي يقوم ببناء وتنظيم المعرفة في شكل تفسيرات وتوقعات قابلة للاختبار حول الكون.(1)(2) يرتكز مفهوم العلم على مصطلح المنهجية العلمية الذي بدوره يدرس البيانات ويضع فرضيات لتفسيرها ويقوم باختبارها وكل هذه العملية للوصول إلى معرفة قائمة على التجربة والتأكد من صحتها بدل التخمين.\r\n\r\nيمكن تتبع جذور العلوم الأولى إلى مصر القديمة وبلاد ما بين النهرين في حوالي 3500 إلى 3000 سنة قبل الميلاد.(3) شكلت مساهماتهم في الرياضيات وعلم الفلك والطب الفلسفة اليونانية الطبيعية للعصور الكلاسيكية القديمة، حيث بُذلت محاولات رسمية لتقديم تفسيرات للأحداث في العالم المادي بناءً على أسباب طبيعية. بعد سقوط الإمبراطورية الرومانية الغربية، تدهورت المعرفة اليونانية في أوروبا الغربية خلال القرون الأولى (400 إلى 1000 للميلاد) في العصور الوسطى ولكن جرى الحفاظ عليها وتطويرها في العالم الإسلامي خلال العصر الذهبي الإسلامي. انتعشت وتُرجمت الأعمال اليونانية وأضيفت إليها الملاحظات الإسلامية لما أصبح اسمها الفلسفة الإسلامية وانتقلت إلى أوروبا من القرن العاش', '2022-01-29 20:25:59');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `new_posts`
--
ALTER TABLE `new_posts`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admins`
--
ALTER TABLE `admins`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `new_posts`
--
ALTER TABLE `new_posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
